/*
    versions, avail on server, file functions
*/

#ifndef _file_veravail_H
#define _file_veravail_H

#include "../../def.h"

#define VERAVAIL_FILE   "veravail.txt"

/* ------------------------------------------------------------------------------------------- *
 *  Пересоздание файла с доступными версиями
 * ------------------------------------------------------------------------------------------- */
bool verAvailClear();

/* ------------------------------------------------------------------------------------------- *
 *  Добавление доступной версии в файл
 * ------------------------------------------------------------------------------------------- */
bool verAvailAdd(const char *ver);

/* ------------------------------------------------------------------------------------------- *
 *  Контрольная сумма всех доступных версий
 * ------------------------------------------------------------------------------------------- */
uint32_t verAvailChkSum();

/* ------------------------------------------------------------------------------------------- *
 *  Поиск доступной версии по номеру в файле
 * ------------------------------------------------------------------------------------------- */
bool verAvailGet(int num, char *ver = NULL);
int verAvailCount();


#endif // _file_veravail_H
