
#include "track.h"
#include "altimeter.h"
#include "gps.h"
#include "logfile.h"

static trk_running_t state = TRKRUN_NONE;


/* ------------------------------------------------------------------------------------------- *
 *  Запуск трекинга
 * ------------------------------------------------------------------------------------------- */
bool trkStart(bool force) {
    if (state != TRKRUN_NONE)
        trkStop();
    
    state = force ? TRKRUN_FORCE : TRKRUN_AUTO;
    Serial.print(F("track started "));
    Serial.println(force ? F("force") : F("auto"));
    return true;
}

/* ------------------------------------------------------------------------------------------- *
 *  Остановка
 * ------------------------------------------------------------------------------------------- */
size_t trkStop() {
    if (state == TRKRUN_NONE)
        return -1;
    
    state = TRKRUN_NONE;
    Serial.println(F("track stopped"));
    return 0;
}

/* ------------------------------------------------------------------------------------------- *
 *  Текущее состояние
 * ------------------------------------------------------------------------------------------- */
bool trkRunning() { return state > TRKRUN_NONE; }
trk_running_t trkState() { return state; }

/* ------------------------------------------------------------------------------------------- *
 *  Запись (на каждый тик тут приходится два тика высотомера и один тик жпс)
 * ------------------------------------------------------------------------------------------- */
void trkProcess() {
    if (state == TRKRUN_NONE)
        return;
}
